def morze_code(string):
    code = {'A': '.-','B': '-...','C': '-.-.','D': '-..','E': '.','F': '..-.','G': '--.','H': '....','I': '..','J': '.---','K': '-.-',
            'L': '.-..','M': '--','N': '-.','O': '---', 'P': '.--.','Q': '--.-','R': '.-.','S': '...','T': '-','U': '..-','V': '...-',
            'W': '.--','X': '-..-','Y': '-.--','Z': '--..', '0': '-----','1': '.----','2': '..---','3': '...--','4': '....-','5': '.....',
            '6': '-....','7': '--...','8': '---..', '9': '----.',' ':' '}
    
    decode=str()
    string=string.upper()
    for i in string:
        decode = decode + code.get(i, ' ошибка символа ')  
       
    return (decode)  


if __name__ == '__main__':
    input_string = input() 
    print(morze_code(input_string)) 
